---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType
source: html/b7b2f972-d2d3-8bde-1055-6e73fa9d8b26.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType

The end type identifying the connection type among stairs runs and landings.

## Syntax (C#)
```csharp
public enum StairsComponentConnectionEndType
```